{"format": "keras", "nodes": [{"name": "backbone_input", "id": "backbone_input", "class_name": "InputLayer", "output_shape": [[null, 224, 224, 1]], "num_parameters": 0}, {"name": "backbone", "id": "backbone", "class_name": "Model", "output_shape": [null, 1240], "num_parameters": 4704840}, {"name": "hidden_layer", "id": "hidden_layer", "class_name": "Dense", "output_shape": [null, 1024], "num_parameters": 1270784}, {"name": "output", "id": "output", "class_name": "Dense", "output_shape": [null, 5], "num_parameters": 5125}], "edges": [["backbone_input", "backbone"], ["backbone", "hidden_layer"], ["hidden_layer", "output"]]}